{
    "products": [
        {
            "id": "lanyard",
            "name": "Lanyards",
            "description": " Keep everything within reach with this Lanyard!",
            "imageUrl": "assets/images/lanyard.jpg",
            "category": ["merchandise"],
            "price": 2.75
        },
        {
            "id": "grad_bear",
            "name": "Graduation Bear",
            "description": "RETURNING for Graduation 2025 Benny the Bear, named by your very own Academic Representation officer Marija, is now available for a limited time only! So be sure to get yours! ❤️️",
            "imageUrl": "assets/images/grad_bear.jpg",
            "category": ["graduation", "merchandise"],
            "options": {
                "Color": ["Cinnamon (Benny the Bear)"]
            },
            "price": 15
        },
        {
            "id": "grad_hoodie",
            "name": "Graduation Hoodie",
            "description": "Treat yourself to one of our UoP Graduation hoodies. Embroidered with the University of Portsmouth crest, our top of the range graduation hoodie is available in two colours and is ideal as a graduation gift or keep sake! Make it that extra special by adding your name, course or year to the back! From only £3 per line of text. ",
            "imageUrl": "assets/images/grad_hoodie.jpg",
            "category": ["graduation", "clothing"],
            "options": {
                "Size": ["S", "M", "L", "XL", "XXL"]
            },
            "price": 35
        },
        {
            "id": "city_postcard",
            "name": "Portsmouth City Postcard",
            "description": "Celebrate the charm of our coastal city with this beautifully illustrated Portsmouth City Postcard, designed by British artist Julia Gash. Featuring her signature hand-drawn style, this postcard captures Portsmouth’s most iconic landmarks - from the Spinnaker Tower to the historic seafront - all brought to life in bold lines and vibrant colours. Perfect for sending home, pinning on your wall, or keeping as a personal keepsake, it’s a fun and affordable way to show off your Portsmouth pride.",
            "imageUrl": "assets/images/city_postcard.jpg",
            "category": ["portsmouthCityCollection"],
            "price": 1
        },
        {
            "id": "city_magnet",
            "name": "Portsmouth City Magnet",
            "description": "Bring a bit of Portsmouth pride to your fridge, locker, or pinboard with our eye-catching Portsmouth City Magnet, featuring the artwork of renowned illustrator Julia Gash. Part of our Portsmouth City Collection, this magnet showcases Julia’s iconic hand-drawn design, celebrating the city’s most loved landmarks and seaside charm in her signature playful style. Made from durable tin plate, it's both lightweight and long-lasting - a perfect souvenir or small gift with a big personality.",
            "imageUrl": "assets/images/city_magnet.jpg",
            "category": ["portsmouthCityCollection"],
            "price": 4.5
        },
        {
            "id": "city_bookmark",
            "name": "Portsmouth City Bookmark",
            "description": "Add a touch of local charm to your reading with this beautifully illustrated Portsmouth City Bookmark, designed by British artist Julia Gash. Featuring her signature hand-drawn style, this bookmark showcases some of Portsmouth’s most iconic landmarks - from the Spinnaker Tower to historic seafront scenes - all brought to life in bold lines and bright colours. Whether you're marking your place in a textbook or gifting a little piece of Portsmouth to a friend, this bookmark is a fun, practical keepsake that celebrates our coastal city.",
            "imageUrl": "assets/images/city_bookmark.jpg",
            "category": ["portsmouthCityCollection"],
            "price": 3
        },
        {
            "id": "city_notebook",
            "name": "Portsmouth City Notebook",
            "description": "Jot down your thoughts, sketches, or seaside daydreams with our charming Portsmouth City Notebook, featuring the artwork of renowned illustrator Julia Gash. Part of our Portsmouth City Collection, this notebook showcases Julia’s iconic hand-drawn design, capturing the city's much-loved landmarks and coastal charm in her signature playful style. With plain, high-quality pages and a sturdy cover, it's perfect for notes, doodles, or travel memories – a practical yet inspiring gift or souvenir with true Portsmouth personality.",
            "imageUrl": "assets/images/city_notebook.jpg",
            "category": ["portsmouthCityCollection"],
            "price": 7.5
        },
        {
            "id": "print_item",
            "name": "Print Item",
            "description": "Personalised print item.",
            "imageUrl": "assets/images/print_item.jpg",
            "category": ["personalised"],
            "price": 3.0
        },
        {
            "id": "classic_sweatshirt_neutral",
            "name": "Classic Sweatshirts - Neutral",
            "description": "Last chance to buy our best selling neutral Classic Sweatshirt. Limited time offer with limited stock. Be quick! Soft, comfortable, 50% cotton and 50% polyester.",
            "imageUrl": "assets/images/classic_sweatshirt_neutral.jpg",
            "options": {
                "Color": ["Vanilla", "Caramel", "Biscuit", "Latte"],
                "Size": ["S", "M", "L", "XL", "XS", "XXL"]
            },
            "category": ["clothing", "sale"],
            "price": 17,
            "salePrice": 10.99
        },
        {
            "id": "Halloween Tote Bags",
            "name": "Halloween Tote Bags",
            "description": "Trick or treat yourself to one of these limited edition Halloween tote bags! Available to purchase in store & online for just £2.50!!! Be quick ... before they do a disappearing act ... Due to the hand crafted nature of this item, final product may differ slightly from original design. Designs will be printed after purchase and be available up to two working days later.",
            "imageUrl": "assets/images/halloween_tote_bag.jpg",
            "options": {
                "Halloween Tote Bag": ["Hello Pumpkin", "Boo!", "Ghosts"]
            },
            "category": ["halloween"],
            "price": 2.5
        },
        {
            "id": "signature_tshirt",
            "name": "Signature T-Shirt",
            "description": "Clean. Classic. Elevated. Our Signature T-shirts combine everyday comfort with premium detail. Featuring high-quality embroidery and a relaxed fit, they offer a fresh take on a staple piece. Lightweight and versatile, this tee is perfect for layering or wearing solo - an essential addition to any wardrobe",
            "imageUrl": "assets/images/signature_tshirt.jpg",
            "category": ["clothing", "signatureAndEssentialsRange"],
            "options": {
                "Color": ["Sand", "Indigo Blue"],
                "Size": ["XS", "S", "M", "L", "XL", "XXL"]
            },
            "price": 14.99 
        },
        {
            "id": "signature_hoodie",
            "name": "Signature Hoodie",
            "description": "Crafted for comfort, elevated with detail — our Signature hoodies feature premium embroidery that sets them apart from our classic range. With a clean design and an oversized fit, they bring a refined edge to a classic silhouette. Whether you're layering up or keeping it simple, this is your new go-to for effortless style.",
            "imageUrl": "assets/images/signature_hoodie.jpg",
            "category": ["clothing", "signatureAndEssentialsRange"],
            "options": {
                "Color": ["Sage", "Ivory"],
                "Size": ["XS", "S", "M", "L", "XL", "XXL"]
            },
            "price": 32.99
        },
        {
            "id": "pride_pin",
            "name": "Pride Flag Pin",
            "description": "A bold and meaningful way to show your pride and support! This vibrant Pride Flag Pin features the iconic rainbow colours—a symbol of love, identity, and unity. Pin it to your jacket, bag, or hat to celebrate who you are and stand in solidarity with the LGBTQ+ community! 🌈✨",
            "imageUrl": "assets/images/pride_pin.jpg",
            "category": ["prideCollection"],
            "price": 1,
            "salePrice": 0.5
        }
    ]
}